### Terraform "dev"
#### Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.documenso_database.random_password.random_password: Refreshing state... [id=none]
module.documenso_database.random_string.random_2: Refreshing state... [id=lJGvyH1875SDt4SA7rCzph4h]
module.documenso_database.random_string.random_1: Refreshing state... [id=ajysbpkqzxytjctpgjbssemq]
data.aws_db_subnet_group.rds: Reading...
data.aws_vpcs.prod: Reading...
data.aws_security_groups.postgres: Reading...
module.documenso_database.aws_secretsmanager_secret_version.sversion: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_lJGvyH1875SDt4SA7rCzph4h-PUhim1|7A4AAA19-E533-4BCA-BA84-DD5A3FDE1CC4]
module.documenso_database.aws_secretsmanager_secret.aws_secretsmanager_secret_rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_lJGvyH1875SDt4SA7rCzph4h-PUhim1]
module.signezily_execution_role.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecsExecutionRole-signezily-dev]
aws_secretsmanager_secret.signezily: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu]
module.signezily_execution_role.aws_iam_policy.custom_policy: Refreshing state... [id=arn:aws:iam::898622234277:policy/AmazonECSExecutionRole_CustomPolicy_signezily_dev]
module.documenso_database.aws_db_instance.postgres: Refreshing state... [id=dev-signezily-20250304032244734500000001]
module.signezily.data.aws_region.current: Reading...
module.signezily.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.signezily.aws_cloudwatch_log_group.tasks[0]: Refreshing state... [id=/ecs/dev/signezily/app]
data.aws_vpcs.prod: Read complete after 0s [id=ap-northeast-1]
data.aws_vpc.prod: Reading...
aws_secretsmanager_secret_version.sversion: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu|5E61F51B-6B3B-47C9-98C7-CAAC9AC98037]
module.signezily_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment[0]: Refreshing state... [id=ecsExecutionRole-signezily-dev-20250122235151860200000002]
module.signezily_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-custom-policy-attachment: Refreshing state... [id=ecsExecutionRole-signezily-dev-20250122235151844400000001]
aws_ecs_task_definition.signezily: Refreshing state... [id=signezily-dev]
data.aws_security_groups.postgres: Read complete after 0s [id=ap-northeast-1]
data.aws_db_subnet_group.rds: Read complete after 0s [id=main]
module.signezily_database.aws_db_instance.postgres: Refreshing state... [id=dev-signezily-20250123000200045200000001]
data.aws_vpc.prod: Read complete after 1s [id=vpc-02eed9d0b0daadb6a]
data.aws_subnets.prod_public: Reading...
data.aws_security_groups.outbound_everywhere: Reading...
data.aws_subnets.prod_private: Reading...
module.signezily.aws_lb_target_group.marketing_site_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-marketing-site-tg/433a8bfd3c7e72a4]
module.signezily.aws_lb_target_group.documentation_site_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-documentation-site-tg/bb2241051a57baba]
module.signezily.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0de70c30958aa261f]
module.signezily.aws_lb_target_group.main["3000"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/signezily-app-dev-3000/4516eb02e93f266d]
module.signezily.aws_security_group.lb[0]: Refreshing state... [id=sg-028be806c1c0271ff]
data.aws_security_groups.outbound_everywhere: Read complete after 0s [id=ap-northeast-1]
data.aws_subnets.prod_private: Read complete after 0s [id=ap-northeast-1]
data.aws_subnets.prod_public: Read complete after 0s [id=ap-northeast-1]
module.signezily.data.aws_subnet.lb_subnets["0"]: Reading...
module.signezily.data.aws_subnet.lb_subnets["2"]: Reading...
module.signezily.data.aws_subnet.lb_subnets["1"]: Reading...
module.signezily.aws_security_group_rule.lb_redirect[0]: Refreshing state... [id=sgrule-2817597403]
module.signezily.aws_security_group_rule.lb_ingress["443"]: Refreshing state... [id=sgrule-1239929890]
module.signezily.aws_security_group_rule.ecs_tasks_ingress["3000"]: Refreshing state... [id=sgrule-1760459262]
module.signezily.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:loadbalancer/app/signezily-dev/0911cf51887b382f]
module.signezily.data.aws_subnet.lb_subnets["1"]: Read complete after 0s [id=subnet-0686f32cf61665fdc]
module.signezily.data.aws_subnet.lb_subnets["2"]: Read complete after 1s [id=subnet-00096d0dc685bc70b]
module.signezily.data.aws_subnet.lb_subnets["0"]: Read complete after 1s [id=subnet-072c04c7bef15119a]
module.signezily.aws_lb_listener.main["443"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78]
module.signezily.aws_lb_listener.redirect[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/660fc083b5bb4ed0]
module.signezily.aws_ecs_service.main_given_task: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:898622234277:service/data/signezily-app-dev]
module.signezily.aws_lb_listener_rule.marketing_site_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/9c336586b5a254cb]
module.signezily.aws_lb_listener_rule.documentation_site_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/72c663fd6fa15e6d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.documenso_database.aws_db_instance.postgres will be destroyed
  # (because aws_db_instance.postgres is not in configuration)
  - resource "aws_db_instance" "postgres" {
      - address                               = "dev-signezily-20250304032244734500000001.cazglawa3sru.ap-northeast-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 20 -> null
      - arn                                   = "arn:aws:rds:ap-northeast-1:898622234277:db:dev-signezily-20250304032244734500000001" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "ap-northeast-1c" -> null
      - backup_retention_period               = 30 -> null
      - backup_window                         = "09:30-10:00" -> null
      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null
      - copy_tags_to_snapshot                 = false -> null
      - customer_owned_ip_enabled             = false -> null
      - db_name                               = "signezily" -> null
      - db_subnet_group_name                  = "main" -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      - endpoint                              = "dev-signezily-20250304032244734500000001.cazglawa3sru.ap-northeast-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_version                        = "13.15" -> null
      - engine_version_actual                 = "13.15" -> null
      - final_snapshot_identifier             = "snapshot-ajysbpkqzxytjctpgjbssemq" -> null
      - hosted_zone_id                        = "Z24O6O9L7SGTNB" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "dev-signezily-20250304032244734500000001" -> null
      - identifier                            = "dev-signezily-20250304032244734500000001" -> null
      - identifier_prefix                     = "dev-signezily-" -> null
      - instance_class                        = "db.t3.micro" -> null
      - iops                                  = 0 -> null
      - latest_restorable_time                = "2025-03-04T06:09:40Z" -> null
      - license_model                         = "postgresql-license" -> null
      - maintenance_window                    = "sun:13:46-sun:14:16" -> null
      - max_allocated_storage                 = 100 -> null
      - monitoring_interval                   = 0 -> null
      - multi_az                              = false -> null
      - name                                  = "signezily" -> null
      - network_type                          = "IPV4" -> null
      - option_group_name                     = "default:postgres-13" -> null
      - parameter_group_name                  = "default.postgres13" -> null
      - password                              = (sensitive value) -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - resource_id                           = "db-YL7HFP5CPEOEZDH6P2MYDM36BM" -> null
      - security_group_names                  = [] -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = false -> null
      - storage_type                          = "gp2" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - username                              = "postgres" -> null
      - vpc_security_group_ids                = [
          - "sg-0af55a137097344ca",
        ] -> null
    }

  # module.documenso_database.aws_secretsmanager_secret.aws_secretsmanager_secret_rds will be destroyed
  # (because aws_secretsmanager_secret.aws_secretsmanager_secret_rds is not in configuration)
  - resource "aws_secretsmanager_secret" "aws_secretsmanager_secret_rds" {
      - arn                            = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_lJGvyH1875SDt4SA7rCzph4h-PUhim1" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_lJGvyH1875SDt4SA7rCzph4h-PUhim1" -> null
      - name                           = "signezily_rds_lJGvyH1875SDt4SA7rCzph4h" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
    }

  # module.documenso_database.aws_secretsmanager_secret_version.sversion will be destroyed
  # (because aws_secretsmanager_secret_version.sversion is not in configuration)
  - resource "aws_secretsmanager_secret_version" "sversion" {
      - arn            = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_lJGvyH1875SDt4SA7rCzph4h-PUhim1" -> null
      - id             = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_lJGvyH1875SDt4SA7rCzph4h-PUhim1|7A4AAA19-E533-4BCA-BA84-DD5A3FDE1CC4" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_lJGvyH1875SDt4SA7rCzph4h-PUhim1" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "7A4AAA19-E533-4BCA-BA84-DD5A3FDE1CC4" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.documenso_database.random_password.random_password will be destroyed
  # (because random_password.random_password is not in configuration)
  - resource "random_password" "random_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.documenso_database.random_string.random_1 will be destroyed
  # (because random_string.random_1 is not in configuration)
  - resource "random_string" "random_1" {
      - id          = "ajysbpkqzxytjctpgjbssemq" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 24 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "ajysbpkqzxytjctpgjbssemq" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.documenso_database.random_string.random_2 will be destroyed
  # (because random_string.random_2 is not in configuration)
  - resource "random_string" "random_2" {
      - id          = "lJGvyH1875SDt4SA7rCzph4h" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 6 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "lJGvyH1875SDt4SA7rCzph4h" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.signezily_database.aws_db_instance.postgres will be updated in-place
  ~ resource "aws_db_instance" "postgres" {
      ~ final_snapshot_identifier             = "snapshot-rbzznpnlpmzyqlwmlcvjelzj" -> (known after apply)
        id                                    = "dev-signezily-20250123000200045200000001"
        name                                  = "signezily"
      ~ password                              = (sensitive value)
        tags                                  = {}
        # (48 unchanged attributes hidden)
    }

  # module.signezily_database.aws_secretsmanager_secret.aws_secretsmanager_secret_rds will be created
  + resource "aws_secretsmanager_secret" "aws_secretsmanager_secret_rds" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
    }

  # module.signezily_database.aws_secretsmanager_secret_version.sversion will be created
  + resource "aws_secretsmanager_secret_version" "sversion" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.signezily_database.random_password.random_password will be created
  + resource "random_password" "random_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.signezily_database.random_string.random_1 will be created
  + resource "random_string" "random_1" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 24
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.signezily_database.random_string.random_2 will be created
  + resource "random_string" "random_2" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 3
      + min_numeric = 6
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 5 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

*Pusher: @tjHsu, Action: `pull_request`*